Revit 2026 API

# TemporaryViewModesDeactivateMode Method

---

Deactivates the given temporary mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DeactivateMode(
	TemporaryViewMode mode
)
```
```vb
Public Sub DeactivateMode (
	mode As TemporaryViewMode
)
```
```cpp
public:
void DeactivateMode(
	TemporaryViewMode mode
)
```
```fsharp
member DeactivateMode :
        mode : TemporaryViewMode -> unit
```

#### Parameters

mode TemporaryViewMode
     The mode to deactivate

| Exception | Condition |
| --- | --- |
| ArgumentException | The temporary mode is not available in the associated view. The view is either of a type that does not support this mode, or is currently in a context that makes the mode presently inapplicable. -or- The temporary mode is presently not enabled in the associated view. |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

The method has no effect on modes that are already deactivated.

#### Reference

TemporaryViewModes Class

Autodesk.Revit.DB Namespace